chriskinal/QuailTracker/esp32_bridge/src/main.c
static esp_netif_t *wifi_ap_netif = NULL;

/* ── WebSocket Client Tracking ─────────────────────────────────── */

#define MAX_WS_CLIENTS 4
static int ws_fds[MAX_WS_CLIENTS] = {0};
static httpd_handle_t ws_server = NULL;

static void ws_add_client(int fd)
{
    for (int i = 0; i < MAX_WS_CLIENTS; i++) {
        if (ws_fds[i] == 0) {
            ws_fds[i] = fd;
            ESP_LOGI(TAG, "WS client added: fd=%d", fd);
            return;
        }
    }
}

static void ws_remove_client(int fd)
{
    for (int i = 0; i < MAX_WS_CLIENTS; i++) {
        if (ws_fds[i] == fd) {
            ws_fds[i] = 0;
            ESP_LOGI(TAG, "WS client removed: fd=%d", fd);
            return;
        }
    }
}

static void ws_broadcast(const char *json)
{
    if (!ws_server) return;

    httpd_ws_frame_t ws_pkt = {
        .type = HTTPD_WS_TYPE_TEXT,
        .payload = (uint8_t *)json,
        .len = strlen(json),
    };

    for (int i = 0; i < MAX_WS_CLIENTS; i++) {
        if (ws_fds[i] != 0) {
            esp_err_t ret = httpd_ws_send_frame_async(ws_server, ws_fds[i], &ws_pkt);
            if (ret != ESP_OK) {
                ws_remove_client(ws_fds[i]);
            }
        }
    }
}

/* ── Web Page (generated from src/web/index.html via xxd) ──────── */

#include "web_data.h"

/* ── HTTP + WebSocket Handlers ─────────────────────────────────── */

/* Called when any HTTP/WS socket closes — clean up stale WS clients */
static void on_sock_close(httpd_handle_t hd, int sockfd)
{
    ws_remove_client(sockfd);
    audio_ws_remove(sockfd);
    /* Auto-stop streaming when last audio client disconnects */
    if (audio_streaming && audio_ws_count() == 0) {
        uint8_t payload[2] = {0, 0};  /* channel=0, enable=0 */
        cmd_enqueue(SPI_CMD_AUDIO_STREAM, payload, 2);
        audio_streaming = false;
        ESP_LOGI(TAG, "Audio: auto-stopped (last client gone)");
    }
    close(sockfd);
}

static esp_err_t root_handler(httpd_req_t *req)
{
    httpd_resp_set_type(req, "text/html");
    httpd_resp_send(req, (const char *)src_web_index_html, src_web_index_html_len);
    return ESP_OK;
}

static int json_get_int(const char *json, const char *key, int def);
void save_duty_cycle(void);
void save_laser_wake(void);

/* State API: returns current config + state as JSON for initial page load */
static esp_err_t api_state_handler(httpd_req_t *req)
{
    httpd_resp_set_type(req, "application/json");
    /* Build a compact JSON with key fields for initial UI population */
    char buf[256];
    snprintf(buf, sizeof(buf),
        "{\"synced\":%d,\"station\":\"%s\",\"gain\":%d,\"fmt\":%d,"
        "\"bat\":%u,\"rec\":%d,\"pwrState\":%d}",
        (int)stm32_synced, local_cfg.stationId,
        (int)local_cfg.gain, (int)local_cfg.recFormat,
        (unsigned)local_state.env_battMv,
        (int)local_state.rec_active,
        (int)local_state.pwr_state);
    httpd_resp_sendstr(req, buf);
    return ESP_OK;
}

/* ESP32 config: GET returns JSON, POST sets values */
static esp_err_t esp_config_get_handler(httpd_req_t *req)
{
    char buf[64];
    snprintf(buf, sizeof(buf), "{\"dutyCycle\":%d,\"laserWake\":%d}",
             wifi_duty_cycle ? 1 : 0, laser_wake_enabled ? 1 : 0);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, buf);
    return ESP_OK;
}

static esp_err_t esp_config_post_handler(httpd_req_t *req)
{
    char buf[128];
    int len = httpd_req_recv(req, buf, sizeof(buf) - 1);
    if (len <= 0) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "No data");
        return ESP_FAIL;
    }
    buf[len] = '\0';

    int val = json_get_int(buf, "dutyCycle", -1);
    if (val >= 0) {
        wifi_duty_cycle = (val != 0);
        if (wifi_duty_cycle) laser_wake_enabled = false;  /* mutually exclusive */
        save_duty_cycle();
    }
    val = json_get_int(buf, "laserWake", -1);
    if (val >= 0) {
        laser_wake_enabled = (val != 0);
        if (laser_wake_enabled) wifi_duty_cycle = false;  /* mutually exclusive */
        save_laser_wake();
        save_duty_cycle();
    }

    httpd_resp_sendstr(req, "OK");
    return ESP_OK;
}

/* Catch-all: return 204 for everything not matched by registered handlers.
 * This satisfies ALL captive portal probes (Android, iOS, Windows) so
 * the phone accepts the connection without showing a portal popup.
 * User types any URL → DNS resolves to us → root handler serves the page. */
static esp_err_t catchall_handler(httpd_req_t *req)
{
    httpd_resp_set_status(req, "204 No Content");
    httpd_resp_send(req, NULL, 0);
    return ESP_OK;
}

/* Map browser JSON command string to SPI command enum + config update */
static void ws_process_command(const char *json)
{
    ESP_LOGI(TAG, "WS cmd: %s", json);

    /* Action commands → enqueue as SPI commands */
    if (strstr(json, "rec_toggle"))     { cmd_enqueue(SPI_CMD_REC_TOGGLE, NULL, 0); return; }
    if (strstr(json, "sd_mount"))       { cmd_enqueue(SPI_CMD_SD_MOUNT, NULL, 0); return; }
    if (strstr(json, "sd_eject"))       { cmd_enqueue(SPI_CMD_SD_EJECT, NULL, 0); return; }
    if (strstr(json, "sd_format"))      { cmd_enqueue(SPI_CMD_SD_FORMAT, NULL, 0); return; }
    if (strstr(json, "survey_start"))   { cmd_enqueue(SPI_CMD_SURVEY_START, NULL, 0); return; }
    if (strstr(json, "survey_clear"))   { cmd_enqueue(SPI_CMD_SURVEY_CLEAR, NULL, 0); return; }
    if (strstr(json, "schedule_on"))    { cmd_enqueue(SPI_CMD_SCHEDULE_ON, NULL, 0); return; }
    if (strstr(json, "schedule_off"))   { cmd_enqueue(SPI_CMD_SCHEDULE_OFF, NULL, 0); return; }
    if (strstr(json, "dev_mode"))       { cmd_enqueue(SPI_CMD_DEV_MODE, NULL, 0); return; }
    if (strstr(json, "model_reload"))   { cmd_enqueue(SPI_CMD_MODEL_RELOAD, NULL, 0); return; }

    if (strstr(json, "audio_stream")) {
        char *p;
        uint8_t ch = 0, en = 1;
        if ((p = strstr(json, "\"ch\":")) != NULL)
            ch = (uint8_t)atoi(p + 5);
        if ((p = strstr(json, "\"en\":")) != NULL)
            en = (uint8_t)atoi(p + 5);
        uint8_t payload[2] = {ch, en};
        cmd_enqueue(SPI_CMD_AUDIO_STREAM, payload, 2);
        audio_streaming = (en != 0);
        if (!audio_streaming) {
            /* Reset ring buffer on stop */
            audio_ring_head = 0;
            audio_ring_tail = 0;
        }
        ESP_LOGI(TAG, "Audio stream: ch=%d en=%d", ch, en);
        return;
    }

    /* Config changes → update local_cfg + bump seq so STM32 adopts */
    if (strstr(json, "set_config")) {
        char *p;
        if ((p = strstr(json, "\"stId\":\"")) != NULL) {
            p += 8;
            const char *end = strchr(p, '"');
            if (end) {
                int len = end - p;
                if (len > 15) len = 15;
                memcpy(local_cfg.stationId, p, len);
                local_cfg.stationId[len] = '\0';
            }
        }
        if ((p = strstr(json, "\"gain\":")) != NULL)
            local_cfg.gain = (uint8_t)atoi(p + 7);
        if ((p = strstr(json, "\"fmt\":")) != NULL)
            local_cfg.recFormat = (uint8_t)atoi(p + 6);
        if ((p = strstr(json, "\"hpf\":")) != NULL)
            local_cfg.bpfLow = (uint16_t)atoi(p + 6);
        if ((p = strstr(json, "\"lpf\":")) != NULL)
            local_cfg.bpfHigh = (uint16_t)atoi(p + 6);
        if ((p = strstr(json, "\"chunk\":")) != NULL)
            local_cfg.chunkMinutes = (uint8_t)atoi(p + 8);
        if ((p = strstr(json, "\"trigEn\":")) != NULL)
            local_cfg.trigEnabled = (uint8_t)atoi(p + 9);
        if ((p = strstr(json, "\"trigDb\":")) != NULL)
            local_cfg.trigDb = (int8_t)atoi(p + 9);
        if ((p = strstr(json, "\"trigPre\":")) != NULL)
            local_cfg.trigPre = (uint8_t)atoi(p + 10);
        if ((p = strstr(json, "\"trigPost\":")) != NULL)
            local_cfg.trigPost = (uint8_t)atoi(p + 11);
        if ((p = strstr(json, "\"lowBat\":")) != NULL)
            local_cfg.lowBatPct = (uint8_t)atoi(p + 9);
        if ((p = strstr(json, "\"autoStop\":")) != NULL)
            local_cfg.autoStop = (uint8_t)atoi(p + 11);
        if ((p = strstr(json, "\"micHdg\":")) != NULL)
            local_cfg.micHeading = (uint16_t)atoi(p + 9);

