chriskinal/QuailTracker/esp32_bridge/src/main.c
static esp_err_t ws_audio_handler(httpd_req_t *req)
{
    if (req->method == HTTP_GET) {
        int fd = httpd_req_to_sockfd(req);
        audio_ws_add(fd);
        ESP_LOGI(TAG, "Audio WS handshake: fd=%d", fd);
        return ESP_OK;
    }

    /* Receive command from browser (start/stop/channel change) */
    httpd_ws_frame_t ws_pkt = {0};
    ws_pkt.type = HTTPD_WS_TYPE_TEXT;

    esp_err_t ret = httpd_ws_recv_frame(req, &ws_pkt, 0);
    if (ret != ESP_OK || ws_pkt.len == 0 || ws_pkt.len >= 256)
        return ESP_OK;

    uint8_t *buf = calloc(1, ws_pkt.len + 1);
    if (!buf) return ESP_OK;
    ws_pkt.payload = buf;
    ret = httpd_ws_recv_frame(req, &ws_pkt, ws_pkt.len);
    if (ret == ESP_OK) {
        buf[ws_pkt.len] = '\0';
        ws_process_command((char *)buf);
    }
    free(buf);
    return ESP_OK;
}

static httpd_handle_t start_webserver(void)
{
    if (ws_server) return ws_server;  /* already running */

    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.max_uri_handlers = 16;
    config.stack_size = 8192;
    config.lru_purge_enable = true;    /* close oldest connection when full */
    config.close_fn = on_sock_close;   /* clean up WS client list on disconnect */
    httpd_handle_t server = NULL;

    if (httpd_start(&server, &config) == ESP_OK) {
        httpd_uri_t root = {
            .uri = "/",
            .method = HTTP_GET,
            .handler = root_handler,
        };
        httpd_register_uri_handler(server, &root);

        httpd_uri_t ws = {
            .uri = "/ws",
            .method = HTTP_GET,
            .handler = ws_handler,
            .is_websocket = true,
        };
        httpd_register_uri_handler(server, &ws);

        httpd_uri_t ws_audio = {
            .uri = "/ws_audio",
            .method = HTTP_GET,
            .handler = ws_audio_handler,
            .is_websocket = true,
        };
        httpd_register_uri_handler(server, &ws_audio);

        httpd_uri_t ota = {
            .uri = "/ota",
            .method = HTTP_POST,
            .handler = ota_handler,
        };
        httpd_register_uri_handler(server, &ota);

        httpd_uri_t stm32_ota = {
            .uri = "/ota_stm32",
            .method = HTTP_POST,
            .handler = stm32_ota_handler,
        };
        httpd_register_uri_handler(server, &stm32_ota);

        httpd_uri_t flash_status = {
            .uri = "/flash_status",
            .method = HTTP_GET,
            .handler = flash_status_handler,
        };
        httpd_register_uri_handler(server, &flash_status);

        httpd_uri_t esp_cfg_get = {
            .uri = "/config_esp",
            .method = HTTP_GET,
            .handler = esp_config_get_handler,
        };
        httpd_register_uri_handler(server, &esp_cfg_get);

        httpd_uri_t esp_cfg_post = {
            .uri = "/config_esp",
            .method = HTTP_POST,
            .handler = esp_config_post_handler,
        };
        httpd_register_uri_handler(server, &esp_cfg_post);

        httpd_uri_t api_state = {
            .uri = "/api/state",
            .method = HTTP_GET,
            .handler = api_state_handler,
        };
        httpd_register_uri_handler(server, &api_state);

        /* Register captive portal probe URLs — return 204 so phones
         * don't show portal popup. Any URL typed by user gets resolved
         * to 192.168.9.1 by our DNS, hitting the root "/" handler. */
        const char *probe_uris[] = {
            "/generate_204",
            "/hotspot-detect.html",
            "/ncsi.txt",
            "/connecttest.txt",
            "/redirect",
            "/success.txt",
            NULL
        };
        httpd_uri_t probe = {
            .method = HTTP_GET,
            .handler = catchall_handler,
        };
        for (int i = 0; probe_uris[i]; i++) {
            probe.uri = probe_uris[i];
            httpd_register_uri_handler(server, &probe);
        }

        ESP_LOGI(TAG, "Web server started on port %d", config.server_port);
    }
    ws_server = server;
    return server;
}

static void stop_webserver(void)
{
    if (ws_server) {
        httpd_stop(ws_server);
        ws_server = NULL;
        memset(ws_fds, 0, sizeof(ws_fds));
        ESP_LOGI(TAG, "Web server stopped");
    }
}

/* ── WiFi AP Start/Stop ────────────────────────────────────────── */

static void wifi_init_netif(void)
{
    /* One-time init of netif + event loop (can't be undone) */
    static bool netif_inited = false;
    if (!netif_inited) {
        ESP_ERROR_CHECK(esp_netif_init());
        ESP_ERROR_CHECK(esp_event_loop_create_default());
        wifi_ap_netif = esp_netif_create_default_wifi_ap();

        /* Use 192.168.9.x subnet */
        esp_netif_ip_info_t ip_info;
        esp_netif_str_to_ip4("192.168.9.1", &ip_info.ip);
        esp_netif_str_to_ip4("192.168.9.1", &ip_info.gw);
        esp_netif_str_to_ip4("255.255.255.0", &ip_info.netmask);
        esp_netif_dhcps_stop(wifi_ap_netif);
        esp_netif_set_ip_info(wifi_ap_netif, &ip_info);
        esp_netif_dhcps_start(wifi_ap_netif);

        wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
        ESP_ERROR_CHECK(esp_wifi_init(&cfg));
        netif_inited = true;
    }
}

static void wifi_start(void)
{
    if (wifi_started) return;

    wifi_init_netif();

    wifi_config_t wifi_config = {
        .ap = {
            .channel = wifi_pick_channel(),
            .authmode = WIFI_AUTH_OPEN,
            .max_connection = MAX_CONNECTIONS,
        },
    };
    strncpy((char *)wifi_config.ap.ssid, device_name, sizeof(wifi_config.ap.ssid));
    wifi_config.ap.ssid_len = strlen(device_name);

    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_AP));
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_AP, &wifi_config));
    ESP_ERROR_CHECK(esp_wifi_start());

    wifi_started = true;
    ESP_LOGI(TAG, "WiFi AP started: SSID=%s, ch=%u, http://192.168.9.1",
             device_name, wifi_pick_channel());
}

/* Load device name from NVS. Returns true if found. */
static bool load_device_name(void)
{
    nvs_handle_t h;
    if (nvs_open("bridge", NVS_READONLY, &h) != ESP_OK) return false;
    size_t len = sizeof(device_name);
    esp_err_t err = nvs_get_str(h, "name", device_name, &len);
    nvs_close(h);
    if (err == ESP_OK && device_name[0]) {
        ESP_LOGI(TAG, "Loaded device name from NVS: %s", device_name);
        return true;
    }
    return false;
}

/* Save device name to NVS */
static void save_device_name(void)
{
    nvs_handle_t h;
    if (nvs_open("bridge", NVS_READWRITE, &h) != ESP_OK) return;
    nvs_set_str(h, "name", device_name);
    nvs_commit(h);
    nvs_close(h);
    ESP_LOGI(TAG, "Saved device name to NVS: %s", device_name);
}

