chriskinal/QuailTracker/esp32_bridge/src/main.c
/* Load WiFi duty cycle setting from NVS */
static void load_duty_cycle(void)
{
    nvs_handle_t h;
    if (nvs_open("bridge", NVS_READONLY, &h) != ESP_OK) return;
    uint8_t val = 0;
    if (nvs_get_u8(h, "duty", &val) == ESP_OK) {
        wifi_duty_cycle = (val != 0);
        ESP_LOGI(TAG, "Loaded duty cycle from NVS: %s", wifi_duty_cycle ? "ON" : "OFF");
    }
    nvs_close(h);
}

/* Save WiFi duty cycle setting to NVS */
void save_duty_cycle(void)
{
    nvs_handle_t h;
    if (nvs_open("bridge", NVS_READWRITE, &h) != ESP_OK) return;
    nvs_set_u8(h, "duty", wifi_duty_cycle ? 1 : 0);
    nvs_commit(h);
    nvs_close(h);
    ESP_LOGI(TAG, "Saved duty cycle to NVS: %s", wifi_duty_cycle ? "ON" : "OFF");
}

/* Load laser wake setting from NVS */
static void load_laser_wake(void)
{
    nvs_handle_t h;
    if (nvs_open("bridge", NVS_READONLY, &h) != ESP_OK) return;
    uint8_t val = 0;
    if (nvs_get_u8(h, "laser", &val) == ESP_OK) {
        laser_wake_enabled = (val != 0);
        ESP_LOGI(TAG, "Loaded laser wake from NVS: %s", laser_wake_enabled ? "ON" : "OFF");
    }
    nvs_close(h);
}

/* Save laser wake setting to NVS */
void save_laser_wake(void)
{
    nvs_handle_t h;
    if (nvs_open("bridge", NVS_READWRITE, &h) != ESP_OK) return;
    nvs_set_u8(h, "laser", laser_wake_enabled ? 1 : 0);
    nvs_commit(h);
    nvs_close(h);
    ESP_LOGI(TAG, "Saved laser wake to NVS: %s", laser_wake_enabled ? "ON" : "OFF");
}

/* Update WiFi SSID and BLE name to match station ID */
static void update_device_name(const char *name)
{
    if (strcmp(device_name, name) == 0) return;  /* no change */

    strncpy(device_name, name, sizeof(device_name) - 1);
    device_name[sizeof(device_name) - 1] = '\0';

    /* Persist to NVS so next boot uses this name immediately */
    save_device_name();

    /* Update BLE advertising name */
    ble_beacon_set_name(device_name);

    /* Restart WiFi AP with new SSID */
    if (wifi_started) {
        wifi_config_t wifi_config = {
            .ap = {
                .channel = wifi_pick_channel(),
                .authmode = WIFI_AUTH_OPEN,
                .max_connection = MAX_CONNECTIONS,
            },
        };
        strncpy((char *)wifi_config.ap.ssid, device_name, sizeof(wifi_config.ap.ssid));
        wifi_config.ap.ssid_len = strlen(device_name);
        esp_wifi_set_config(WIFI_IF_AP, &wifi_config);
        ESP_LOGI(TAG, "WiFi SSID updated: %s", device_name);
    }
}

static void wifi_stop(void)
{
    if (!wifi_started) return;

    stop_webserver();
    esp_wifi_stop();
    wifi_started = false;
    ESP_LOGI(TAG, "WiFi AP stopped");
}

/* ── STM32 Wake (pull CS pin low for 10ms) ─────────────────────── */

static void stm32_wake(void)
{
    if (!stm32_sleeping) return;

    ESP_LOGI(TAG, "Waking STM32 via GPIO5 (CS) pulse");

    /* Temporarily reconfigure GPIO5 from SPI CS to GPIO output */
    if (spi_initialized) {
        spi_slave_free(SPI_HOST);
        spi_initialized = false;
    }

    gpio_config_t io = {
        .pin_bit_mask = (1ULL << PIN_CS),
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&io);

    /* Pull LOW for 10ms to trigger EXTI0 on STM32 */
    gpio_set_level(PIN_CS, 0);
    vTaskDelay(pdMS_TO_TICKS(10));
    gpio_set_level(PIN_CS, 1);

    /* Wait for STM32 to wake and restore SPI */
    vTaskDelay(pdMS_TO_TICKS(100));
    stm32_sleeping = false;
}

/* ── STM32 Control Pins (high-Z until needed for flashing) ───── */

#define PIN_STM32_NRST   2
#define PIN_STM32_BOOT0  3

static void stm32_pins_init(void)
{
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << PIN_STM32_BOOT0) | (1ULL << PIN_STM32_NRST),
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&io_conf);
    ESP_LOGI(TAG, "STM32 BOOT0/NRST pins set to high-Z");
}

/* ── SPI Slave Init/Deinit ─────────────────────────────────────── */

void spi_slave_init(void)
{
    if (spi_initialized) return;

    spi_bus_config_t busCfg = {
        .mosi_io_num = PIN_MOSI,
        .miso_io_num = PIN_MISO,
        .sclk_io_num = PIN_SCK,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = TRANSFER_SIZE,
    };

    spi_slave_interface_config_t slaveCfg = {
        .mode = 0,
        .spics_io_num = PIN_CS,
        .queue_size = 3,
        .flags = 0,
    };

    ESP_ERROR_CHECK(spi_slave_initialize(SPI_HOST, &busCfg, &slaveCfg, SPI_DMA_CH_AUTO));
    spi_initialized = true;
    ESP_LOGI(TAG, "SPI slave initialized");
}

/* Parse a simple integer value from JSON: "key":123 */
static int json_get_int(const char *json, const char *key, int def)
{
    char search[32];
    snprintf(search, sizeof(search), "\"%s\":", key);
    const char *p = strstr(json, search);
    if (!p) return def;
    p += strlen(search);
    return atoi(p);
}

/* Parse a string value from JSON: "key":"value" into buf (max buflen-1 chars) */
static bool json_get_str(const char *json, const char *key, char *buf, int buflen)
{
    char search[32];
    snprintf(search, sizeof(search), "\"%s\":\"", key);
    const char *p = strstr(json, search);
    if (!p) return false;
    p += strlen(search);
    const char *end = strchr(p, '"');
    if (!end) return false;
    int len = end - p;
    if (len >= buflen) len = buflen - 1;
    memcpy(buf, p, len);
    buf[len] = '\0';
    return true;
}

/* ── SPI Slave Task ────────────────────────────────────────────── */

static void spi_task(void *arg)
{
    /* Send ESP_VERSION on first exchange so STM32 knows our firmware */
    cmd_enqueue(SPI_CMD_ESP_VERSION, (const uint8_t *)ESP_FW_VERSION,
                strlen(ESP_FW_VERSION));

    while (1) {
        if (spi_task_stop) {
            ESP_LOGI(TAG, "SPI task stopping");
            spi_task_handle = NULL;
            vTaskDelete(NULL);
            return;
        }
        if (!spi_initialized) {
            vTaskDelay(pdMS_TO_TICKS(100));
            continue;
        }

        /* Build TX frame */
        spi_frame_t *tx = (spi_frame_t *)spi_txBuf;
        memset(tx, 0, TRANSFER_SIZE);

        tx->header.magic = SPI_FRAME_MAGIC;
        tx->header.frame_version = SPI_FRAME_VERSION;
        tx->header.cfg_seq = local_cfg_seq;

        uint16_t flags = 0;
        if (first_boot) {
            flags |= SPI_FLAG_BOOT;
            first_boot = false;
        }
        if (local_cfg_seq > 0)
            flags |= SPI_FLAG_CONFIG_DIRTY;

        /* Copy local config into frame */
        memcpy(&tx->config, &local_cfg, sizeof(device_config_t));

