chriskinal/QuailTracker/esp32_bridge/src/main.c
        /* Update BLE advertising data periodically */
        ble_beacon_update_data(local_state.env_battMv,
                               local_state.rec_active,
                               local_state.pwr_state);
    }
}

/* ── Audio Push Task ───────────────────────────────────────────── */

static void audio_push_task(void *arg)
{
    /* Buffer for binary WS frame: up to 214 samples = 428 bytes */
    static int16_t push_buf[214];

    while (1) {
        vTaskDelay(pdMS_TO_TICKS(25));

        if (!audio_streaming || !ws_server || audio_ws_count() == 0) {
            /* Drain ring to avoid stale data accumulating */
            audio_ring_tail = audio_ring_head;
            continue;
        }

        /* Copy available samples from ring */
        uint32_t h = audio_ring_head;
        uint32_t t = audio_ring_tail;
        uint32_t avail = h - t;
        if (avail == 0) continue;
        if (avail > 214) {
            /* Drop excess to prevent growing latency */
            t = h - 214;
        }

        uint16_t count = 0;
        while (t != h && count < 214) {
            push_buf[count++] = audio_ring[t & AUDIO_RING_MASK];
            t++;
        }
        audio_ring_tail = t;

        if (count == 0) continue;

        /* Send binary frame to all audio WS clients */
        httpd_ws_frame_t ws_pkt = {
            .type = HTTPD_WS_TYPE_BINARY,
            .payload = (uint8_t *)push_buf,
            .len = count * sizeof(int16_t),
        };

        for (int i = 0; i < MAX_AUDIO_CLIENTS; i++) {
            if (audio_ws_fds[i] != 0) {
                esp_err_t ret = httpd_ws_send_frame_async(
                    ws_server, audio_ws_fds[i], &ws_pkt);
                if (ret != ESP_OK) {
                    audio_ws_remove(audio_ws_fds[i]);
                }
            }
        }
    }
}

/* ── BLE Callbacks ─────────────────────────────────────────────── */

static void on_ble_connect(void)
{
    ESP_LOGI(TAG, "BLE client connected — transitioning to NORMAL_POWER");
    bridge_state = BRIDGE_NORMAL_POWER;
    disconnect_tick = 0;

    /* Wake STM32 if it's sleeping */
    if (stm32_sleeping) {
        stm32_wake();
    }
}

static void on_ble_disconnect(void)
{
    ESP_LOGI(TAG, "BLE client disconnected — starting 30s timeout");
    disconnect_tick = xTaskGetTickCount();
}

/* ── Power Management Task ─────────────────────────────────────── */

/* ── Captive Portal DNS Server ──────────────────────────────────── */

/* Minimal DNS server: responds to ALL queries with 192.168.9.1.
 * This makes the phone think it needs to "log in", triggering the
 * captive portal popup which loads our web UI automatically. */
static void dns_task(void *arg)
{
    int sock = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
    if (sock < 0) {
        ESP_LOGE(TAG, "DNS: socket failed");
        vTaskDelete(NULL);
        return;
    }

    struct sockaddr_in saddr = {
        .sin_family = AF_INET,
        .sin_port = htons(53),
        .sin_addr.s_addr = htonl(INADDR_ANY),
    };
    if (bind(sock, (struct sockaddr *)&saddr, sizeof(saddr)) < 0) {
        ESP_LOGE(TAG, "DNS: bind failed");
        close(sock);
        vTaskDelete(NULL);
        return;
    }

    ESP_LOGI(TAG, "DNS captive portal started on port 53");

    uint8_t buf[512];
    while (1) {
        struct sockaddr_in client;
        socklen_t clen = sizeof(client);
        int len = recvfrom(sock, buf, sizeof(buf), 0, (struct sockaddr *)&client, &clen);
        if (len < 12) continue;  /* too short for DNS header */

        /* Build response: copy query, set response flags, append answer */
        uint8_t resp[512];
        memcpy(resp, buf, len);

        /* Set QR=1 (response), AA=1 (authoritative), RA=1 */
        resp[2] = 0x84;  /* QR=1, Opcode=0, AA=1, TC=0, RD=0 */
        resp[3] = 0x00;  /* RA=0, Z=0, RCODE=0 (no error) */

        /* Answer count = 1 */
        resp[6] = 0x00;
        resp[7] = 0x01;

        /* Append answer: pointer to name in query + type A + class IN + TTL + IP */
        int pos = len;
        resp[pos++] = 0xC0;  /* pointer to name at offset 12 */
        resp[pos++] = 0x0C;
        resp[pos++] = 0x00; resp[pos++] = 0x01;  /* type A */
        resp[pos++] = 0x00; resp[pos++] = 0x01;  /* class IN */
        resp[pos++] = 0x00; resp[pos++] = 0x00;
        resp[pos++] = 0x00; resp[pos++] = 0x0A;  /* TTL = 10s */
        resp[pos++] = 0x00; resp[pos++] = 0x04;  /* data length = 4 */
        resp[pos++] = 192;                        /* 192.168.9.1 */
        resp[pos++] = 168;
        resp[pos++] = 9;
        resp[pos++] = 1;

        sendto(sock, resp, pos, 0, (struct sockaddr *)&client, clen);
    }
}

/* ── Power Management Task ─────────────────────────────────────── */

static void power_mgmt_task(void *arg)
{
    uint32_t duty_cycle_tick = xTaskGetTickCount();

    while (1) {
        vTaskDelay(pdMS_TO_TICKS(1000));

        /* Check if any WiFi clients are connected */
        wifi_sta_list_t sta_list;
        int wifi_clients = 0;
        if (wifi_started && esp_wifi_ap_get_sta_list(&sta_list) == ESP_OK) {
            wifi_clients = sta_list.num;
        }

        /* Reset duty cycle timer while client is connected */
        if (wifi_clients > 0) {
            duty_cycle_tick = xTaskGetTickCount();
        }

        /* Boot grace period: stay awake for 3 min after boot so user can connect */
        uint32_t uptime_ms = xTaskGetTickCount() * portTICK_PERIOD_MS;
        if (uptime_ms < BOOT_GRACE_MS) continue;

        /* WiFi duty cycle: on 20s, then deep sleep 40s.
         * Deep sleep draws ~5µA vs 44mA with WiFi off + CPU idle.
         * On wake, ESP32 reboots — WiFi/NVS/BLE all reinitialize. */
        if (wifi_duty_cycle && wifi_clients == 0) {
            uint32_t elapsed = (xTaskGetTickCount() - duty_cycle_tick) * portTICK_PERIOD_MS;
            if (elapsed >= WIFI_DUTY_ON_MS) {
                ESP_LOGI(TAG, "Duty cycle: entering deep sleep for %ds", WIFI_DUTY_SLEEP_S);
                esp_deep_sleep(WIFI_DUTY_SLEEP_S * 1000000ULL);
                /* Does not return — ESP32 reboots on wake */
            }
        }

