chriskinal/QuailTracker/esp32_bridge/src/main.c
        /* Laser wake: deep sleep indefinitely, wake on GPIO0 high.
         * Stay awake while WiFi clients are connected + 30s grace period. */
        if (laser_wake_enabled && wifi_clients == 0) {
            uint32_t elapsed = (xTaskGetTickCount() - duty_cycle_tick) * portTICK_PERIOD_MS;
            if (elapsed >= (LASER_IDLE_SLEEP_S * 1000)) {
                ESP_LOGI(TAG, "Laser wake: entering deep sleep (GPIO%d wake)", PIN_LASER_WAKE);
                esp_err_t err = esp_deep_sleep_enable_gpio_wakeup(
                    1ULL << PIN_LASER_WAKE, ESP_GPIO_WAKEUP_GPIO_HIGH);
                if (err != ESP_OK) {
                    ESP_LOGE(TAG, "GPIO wake setup FAILED: %s", esp_err_to_name(err));
                } else {
                    vTaskDelay(pdMS_TO_TICKS(100));  /* let log flush */
                    esp_deep_sleep_start();
                    /* Does not return — ESP32 reboots on wake */
                }
            }
        }
    }
}

/* ── Laser Wake Sensor (GPIO0 phototransistor) ─────────────────── */

static void laser_sensor_init(void)
{
    gpio_config_t io = {
        .pin_bit_mask = (1ULL << PIN_LASER_WAKE),
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,  /* external 10K pull-down */
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&io);
    ESP_LOGI(TAG, "Laser wake sensor on GPIO%d", PIN_LASER_WAKE);
}

/* Log wake cause on boot */
static void laser_wake_check(void)
{
    esp_sleep_wakeup_cause_t cause = esp_sleep_get_wakeup_cause();
    if (cause == ESP_SLEEP_WAKEUP_GPIO) {
        ESP_LOGI(TAG, "Woke from deep sleep via laser (GPIO%d)", PIN_LASER_WAKE);
    }
}


/* ── Main ──────────────────────────────────────────────────────── */

void app_main(void)
{
    printf("\n=== ESP32-C3 QuailTracker Bridge v2 ===\n\n");

    /* FIRST: release STM32 BOOT0/NRST pins to high-Z */
    stm32_pins_init();

    /* Initialize NVS (required for WiFi + BLE) */
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ESP_ERROR_CHECK(nvs_flash_init());
    }

    /* Load device name: NVS first, then fall back to MAC-based default */
    if (!load_device_name()) {
        uint8_t mac[6];
        esp_read_mac(mac, ESP_MAC_WIFI_STA);
        snprintf(device_name, sizeof(device_name), "QT_%02X%02X", mac[4], mac[5]);
        ESP_LOGI(TAG, "No saved name, using default: %s", device_name);
    }

    load_duty_cycle();
    load_laser_wake();

    /* Initialize binary SPI protocol state */
    memset(&local_cfg, 0, sizeof(local_cfg));
    local_cfg.micHeading = 0xFFFF;  /* unset until synced from STM32 */
    memset(&local_state, 0, sizeof(local_state));
    local_cfg_seq = 0;
    stm32_synced = false;
    first_boot = true;

    /* Initialize network interface (needed before WiFi or BLE) */
    wifi_init_netif();

    /* Start BLE beacon (always active for device discovery) */
    ble_beacon_init(device_name, on_ble_connect, on_ble_disconnect);

    /* Start in NORMAL_POWER on boot so WiFi AP is available for setup.
     * Will transition to LOW_POWER after BLE disconnect timeout if no
     * user is connected, or when STM32 sends sleep command. */
    bridge_state = BRIDGE_NORMAL_POWER;
    wifi_start();
    start_webserver();
    spi_slave_init();
    laser_sensor_init();
    laser_wake_check();

    xTaskCreate(spi_task, "spi_task", 4096, NULL, 3, &spi_task_handle);
    xTaskCreate(ws_push_task, "ws_push", 4096, NULL, 4, NULL);
    xTaskCreate(audio_push_task, "audio_push", 3072, NULL, 4, NULL);
    xTaskCreate(power_mgmt_task, "pwr_mgmt", 4096, NULL, 2, NULL);
    xTaskCreate(dns_task, "dns", 4096, NULL, 2, NULL);

    ESP_LOGI(TAG, "Bridge ready — BLE Beacon + WiFi AP + SPI + WebSocket");
}
